{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "text_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "int32", "sparse": false, "name": "text_input"}, "inbound_nodes": []}, {"name": "pos_emb", "class_name": "Embedding", "config": {"name": "pos_emb", "trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 4230, "output_dim": 4230, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 20}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "conv_layer", "class_name": "Conv1DWithMasking", "config": {"name": "conv_layer", "trainable": true, "filters": 50, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pos_emb", 0, 0, {}]]]}, {"name": "pooling", "class_name": "MeanPool", "config": {"name": "pooling", "trainable": true}, "inbound_nodes": [[["conv_layer", 0, 0, {}]]]}, {"name": "drop_layer", "class_name": "Dropout", "config": {"name": "drop_layer", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["pooling", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 11, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_layer", 0, 0, {}]]]}], "input_layers": [["text_input", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}